app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2018-05-25 06:07:31.174337"], ["updated_at", "2018-05-25 06:07:31.174337"]]
---
  def create
    @school_class = SchoolClass.new(school_params)
    @school_class.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-05-25 06:30:37.994623"], ["id", 1]]
---
  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(school_params)